Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: to talk to you about something.
es_419: Porque quería hablarte de algo.

source: when mr. chae called me by my name...
es_419: Cuando el señor Chae dijo mi nombre…

source: no, I shouldn't have jumped to conclusions.
es_419: No, yo no debí haber leído entre líneas.

source: no, I'm good.
es_419: No, te agradezco.

source: what is...
es_419: ¿Qué es…

source: oh, is brand A out of stock? then how about brand B?
es_419: Ah, ¿la marca A no tiene más? ¿Y qué hay de la B?

source: ...all dolled up!
es_419: ¡Muy bien vestida!

source: it's still exhausting, but still. haha.
es_419: Igual es agotador, pero sí. Ja, ja.

source: what should I do?
es_419: ¿Qué hago?

source: but he doesn't seem that mean. actually, he's quite gentle.
es_419: Pero no parece ser tan malo. Más bien, es bastante amable.

source: wahhh!
es_419: ¡BUAAA!

source: swish
es_419: FIUSH

source: Oh.
es_419: Ah.

source: why are you looking at me?
es_419: ¿Por qué me miras a mí?

source: designer clothes sure are hard to even dry clean.
es_419: Cuesta lavar la ropa de diseño hasta en lavandería.

source: dad…
es_419: Papá…

source: stand
es_419: DE PIE

source: oh, my...
es_419: Madre de…

source: what I want to do...
es_419: Lo que quiero hacer…

source: oops.
es_419: Ups.

source: can you please explain, mr. chae?
es_419: ¿Me puedes explicar, señor Chae?

source: but...
es_419: Pero…

source: if it's okay with you…
es_419: Si te parece bien…

source: I mean, mr. chairman. what brings you here...
es_419: Digo, señor presidente. ¿Qué te trae por aquí?…

source: I realized that I was a terrible boss.
es_419: me di cuenta de que era un jefe espantoso.

source: get some water.
es_419: buscar agua.

source: are you all right? if you're tired, we can see--
es_419: ¿Estás bien? Si estás cansada, podemos ver de…

source: I'm so excited!
es_419: ¡Qué emoción!

source: the chairman can find out what happened if he tries...
es_419: Si se lo propone, el presidente puede averiguar qué pasó…

source: he has a kid?
es_419: ¿Es padre?

source: no way!
es_419: ¡No creo!

source: the car fell off the cliff and the couple was killed on the spot.
es_419: El coche cayó por el barranco y la pareja murió al instante.

source: card news
es_419: noticias de tarjetas

source: oops!
es_419: ¡Ups!

source: Lately, I haven't had the chance to talk to Yu-eun.
es_419: Últimamente, no he podido hablar con Yu-eun.

source: what was that about?
es_419: ¿Qué fue eso?

source: I guess this isn't the right time.
es_419: Creo que no es el mejor momento.

source: a match made in heaven.
es_419: Somos el uno para el otro.

source: you can have a glass, right?
es_419: Puedes beber una copa, ¿no?

source: served in a flash of light.jpg
es_419: Servido a la velocidad de la luz.jpg

source: has he finally lost it?
es_419: ¿Al fin se volvió loco?

source: ouch!
es_419: ¡Auch!

source: no, I was trying to show that I was.
es_419: No, quería demostrar que lo hacía.

source: now I really have to leave this company!
es_419: ¡Ahora sí me tengo que ir de esta empresa!

source: *about 3 USD
es_419: * MÁS O MENOS USD 3.

source: it felt great to see you like that...
es_419: Se sintió muy bien verte así…

source: I'd better look for another vehicle.
es_419: Mejor busco otro vehículo.

source: I take better care of my health than you do.
es_419: Yo cuido mi salud mejor que tú.

source: oh my gosh!
es_419: ¡No puede ser!

source: mujin kim. he was…
es_419: Mujin Kim. Él…

source: oh, by the way!
es_419: ¡Ah, por cierto!

source: hmm… yeah, I should tell him I'll be resigning soon.
es_419: Mmm… Sí, mejor le digo que renunciaré pronto.

source: That doesn't change anything.
es_419: Eso no cambia nada.

source: ugh, this is so embarrassing!
es_419: Uff, ¡qué vergüenza!

source: who is it?
es_419: ¿Quién es?

source: pretending like I didn't see anything is the nice thing to do, right?
es_419: Lo más amable es hacer de cuenta de que no vi nada, ¿no?

source: i-i apologize, sir.
es_419: D-disculpe, señor.

source: where...
es_419: ¿Dónde…?

source: I bitterly regret my behavior.
es_419: Lamento mucho mi conducta.

source: she was wearing a man's coat...
es_419: Llevaba puesto un abrigo de hombre…

source: I was going to quit anyway.
es_419: De todas formas, iba a renunciar.

source: y-yes, sir?
es_419: ¿S-sí, señor?

source: sir?
es_419: ¿Señor?

source: ms. gam!
es_419: ¡Señorita Gam!

source: mr. chae
es_419: Señor Chae

source: I see…
es_419: Entiendo…

source: they'll go bad! hurry!
es_419: ¡Se echará a perder!

source: your resigning is one of them.
es_419: Una de ellas fue tu renuncia.

source: you can't...
es_419: ¡No me puedes…

source: ...yet I can't think of a single place to invest or spend it on.
es_419: … pero no se me ocurre nada para invertir o en qué gastar.

source: gulp
es_419: GLUP

source: sure.
es_419: Claro.

source: wh-what was all that about?!
es_419: ¡¿Qué fue todo eso?!

source: - episode 01 -
es_419: - episodio 01 -

source: my whole career as a secretary?
es_419: ¿Toda una carrera de secretaria?

source: what? whoa!
es_419: ¿Qué? ¡Uooo!

source: ...that he might actually be a better person than I thought.
es_419: … que podría ser mejor persona de lo que creía.

source: coming late to work?
es_419: ¿Llegar tarde?

source: I won't do it again.
es_419: No lo volveré a hacer.

source: you're even cuter in the morning.
es_419: Estás aún más linda por la mañana.

source: Just you wait...
es_419: Ya verás…

source: groan
es_419: ouuu

source: oh, I'm going to give it to dohyeok and yu-eun.
es_419: Ah, es un regalo para Dohyeok y Yu-eun.

source: I hit the lottery. aren't you jealous?
es_419: Gané la lotería. ¿No te da celos?

source: I mean it…
es_419: De verdad…

source: I should've told seogyeong.
es_419: Debí decirle a Seogyeong.

source: ...she comes to work by 8 AM...
es_419: … llega al trabajo a las 8…

source: HUFF
es_419: UFF

source: right.
es_419: Cierto.

source: first meal with dohyeok.
es_419: Primera comida con Dohyeok.

source: oh no...
es_419: Ay, no…

source: it's too bad...
es_419: Qué lástima…

source: ...but it's not fair! look at that face!
es_419: ¡Pero no es justo! ¡Miren esa cara!

source: something's wrong with my kid!
es_419: ¡Mi hijo tiene un problema!

source: silent
es_419: SILENCIO

source: and so, after observing ms. gam for the past few days, I've found that...
es_419: Así, tras observar un par de días a la señorita Gam, me di cuenta de que…

source: I lost a lot of money investing after everyone else.
es_419: Cuando invertí como los demás, perdí un montón de dinero.

source: I've never done that before.
es_419: Nunca lo he hecho.

source: TREMBLE
es_419: TIEMBLA

source: ...on resigning for the time being!!!
es_419: ¡¡No voy a renunciar por ahora!!

source: I'm not giving up on you.
es_419: No te dejaré ir.

source: you just can't hold your alcohol, that's all!
es_419: ¡Lo que pasa es que tienes cero tolerancia!

source: dash
es_419: CORRE

source: my mother also… passed away.
es_419: Mi madre también… falleció.

source: I can enjoy work with a more relaxed attitude.
es_419: Puedo disfrutar del trabajo y estar más relajada.

source: invest in stock?
es_419: ¿Invierto en bolsa?

source: I have to get used to this…
es_419: Me tengo que acostumbrar…

source: wow, it looks good!
es_419: ¡Guau, se ve rico!

source: ...it didn't work out.
es_419: … no funcionó.

source: dohyeok might be married.
es_419: Creo que Dohyeok está casado.

source: I guess...
es_419: Supongo…

source: was there a problem?
es_419: ¿Hubo algún problema?

source: isn't it pretty?
es_419: ¿No es lindo?

source: our lives have been.
es_419: han sido nuestras vidas.

source: i refuse.
es_419: La rechazo.

source: yes, sir!
es_419: ¡Sí, señor!

source: raise
es_419: alza

source: if a dwarf enters the world of giants...
es_419: Si una enana entra en un mundo de gigantes…

source: ...why she said what she said...
es_419: … por qué ella dijo lo que dijo…

source: don't you think, yu-eun?
es_419: ¿Qué te parece, Yu-eun?

source: he's surprisingly fussy.
es_419: es muy exigente.

source: it's…
es_419: En…

source: oh
es_419: AH

source: I want you to look at the flowers now and then...
es_419: Quiero que tú aprecies las flores de tanto en tanto…

source: I don't mind the extra costs.
es_419: No importa el costo adicional.

source: yeah…
es_419: Sí…

source: …just for a moment.
es_419: Quédate aquí.

source: wait!
es_419: ¡Espera!

source: I will never forget this.
es_419: No lo olvidaré jamás.

source: I won!
es_419: ¡Gané!

source: desired salary
es_419: Sueldo pretendido

source: it's already been ten years since I've lived alone.
es_419: Hace ya diez años que vivo sola.

source: I can ring you up over here.
es_419: Puedo hacerle la cuenta aquí.

source: are you all right?!
es_419: ¡¿Estás bien?!

source: you used to call me "ms. kang." you didn't even get my last name right.
es_419: Antes me decía señorita Kang. Ni siquiera le atinaba a mi apellido.

source: and just why did my hair have to look so good today?!
es_419: ¡¿Y por qué justo hoy tenía que tener el pelo tan lindo?!

source: puff
es_419: BUFF

source: how did it happen?
es_419: ¿Cómo pasó?

source: don't feel pressured.
es_419: Sin presiones.

source: can't I just say hi to her?
es_419: ¿No la puedo saludar y ya?

source: on top of that,
es_419: Además,

source: sheesh...
es_419: Dios…

source: let me hear you out first.
es_419: Primero cuéntame todo.

source: what do you plan to do once you stop working?
es_419: ¿Qué planeas hacer cuando dejes de trabajar?

source: you smarty pants.
es_419: Te pasas de vivo.

source: when I first saw you, I felt...
es_419: La primera vez que te vi, sentí…

source: Jeju island…
es_419: La isla Jeju…

source: ...it's good…
es_419: … me gusta…

source: me?
es_419: ¿Yo?

source: wow, you're the best!
es_419: ¡Guau, él es lo más!

source: do you have a kid I don't know about?
es_419: ¿Tienes un hijo que no conozco?

source: - episode 30 -
es_419: - episodio 30 -

source: is out-of-order.
es_419: está descarriada.

source: hmm?
es_419: ¿Mmm?

source: flustered
es_419: AGITADA

source: total eye candy.
es_419: Te endulza los ojos.

source: haha
es_419: JAJA

source: ...didn't look so good earlier.
es_419: … parecía sentirse mal.

source: y-yes, sir...
es_419: S-sí, señor…

source: that stuff only applies to babies, and ms. gam obviously isn't one. you're just jinxing yourself.
es_419: Solo sirve para bebés, y está claro que la señorita Gam no lo es. Te va a salir el tiro por la culata.

source: I'm…
es_419: Voy a…

source: I love it!
es_419: ¡Me encanta!

source: y-you passed!
es_419: ¡P-pasaste!

source: clean sweep!
es_419: ¡Derrota total!

source: you can sleep for a bit longer.
es_419: Duerme un poquito más.

source: keep up the good work!
es_419: ¡Sigue así!

source: big data based on experience
es_419: Big data basado en experiencia

source: but it's late.
es_419: Pero es tarde.

source: royal members account book
es_419: Libro de cuentas miembros élite

source: n-no, it's okay!
es_419: ¡N-no, está bien!

source: I'm leaving the company soon.
es_419: Pronto me iré de la empresa.

source: But you kiss your boss when you're about to quit your job?
es_419: Pero ¿tú besas a tu jefe cuando estás a punto de renunciar?

source: okay. see you later!
es_419: Bueno. ¡Nos vemos!

source: I should've just made something up. why was I so honest?
es_419: Debería haber inventado algo. ¿Por qué fui tan sincera?

source: shake
es_419: SACUDE

source: I think I'm an average drinker.
es_419: Creo que bebo como cualquiera.

source: …avoiding me?
es_419: … evitando?

source: please correct your attire.
es_419: Arréglate el atuendo.

source: by the way, get off my desk.
es_419: Ah, y bájate del escritorio.

source: here's your coffee, sir!
es_419: ¡Aquí está su café, señor!

source: I knew it! our ace of the group!
es_419: Ya me parecía! El as del grupo!

source: you two!
es_419: ¡Ustedes!

source: ms. gam, you left your pouch.
es_419: Señorita Gam, olvidaste algo.

source: tap tap tap
es_419: TAC TAC TAC

source: okay...
es_419: Bueno…

source: ...is this what you really want?
es_419: ¿De verdad quieres hacer eso?

source: no more bending to dohyeok's every whim!
es_419: ¡Basta de cumplir cada capricho de Dohyeok!

source: you think we'll believe that?
es_419: ¿Pretendes que te creamos?

source: I've heard that this workshop was actually held as a farewell party for the boss's secretary.
es_419: Oí que este taller en realidad es una fiesta de despedida para la secretaria del jefe.

source: same day, 9:05 AM.
es_419: Ese día, a las 9:05.

source: e-excuse me...
es_419: D-disculpen…

source: yes. haha.
es_419: Sí. Ja, ja.

source: thank you for your hard work.
es_419: Gracias por esforzarte tanto.

source: - episode 22 -
es_419: - episodio 22 -

source: let's be… friends.
es_419: Seamos… amigos.

source: th-this is bad.
es_419: Esto pinta mal.

source: I don't know since I don't drink.
es_419: No sé, porque no bebo nunca.

source: ROAR
es_419: GRUOO

source: wait a second.
es_419: Un momento.

source: h-help!
es_419: ¡A-ayuda!

source: friends?
es_419: ¿Amigos?

source: am I intruding? then I can--
es_419: ¿Los interrumpo? Puedo…

source: there's cucumber in my sandwich.
es_419: Mi sándwich tiene pepino.

source: why, I ought to...
es_419: Será posible, lo voy a…

source: is this the right address?
es_419: ¿Es la dirección correcta?

source: because they don't see what's around them.
es_419: Porque no ven lo que tienen a su alrededor.

source: well, this workshop…
es_419: Que el taller…

source: y-yeah?
es_419: ¿S-sí?

source: peaceful
es_419: TRANQUILO

source: it's been so long since I've cooked.
es_419: Hace mucho que no cocino.

source: ...that we were alike.
es_419: … que éramos similares.

source: haha… this serial job-hopper is glad to be of any help.
es_419: Ja, ja… Como cambiadora serial de empleo, me alegra ayudar.

source: it's yu-eun.
es_419: Yu-eun.

source: can I call you later--
es_419: Lo puedo llamar luego…

source: just eat it already...
es_419: Cómetelo de una vez…

source: and he and I become romantically involved.
es_419: Y él y yo empezamos una relación.

source: Yeah.
es_419: Sí.

source: thought he was incapable of expressing sympathy…
es_419: Lo creí incapaz de expresar compasión…

source: first of all,
es_419: Antes que nada,

source: s p a r k l e
es_419: t i l í n

source: from france!
es_419: ¡De Francia!

source: I see. that's a shame.
es_419: Entiendo. Qué lástima.

source: clang
es_419: tran

source: um... so how's your tolerance?
es_419: Eh… ¿y cuánto puede beber?

source: This is all a mistake.
es_419: Es un gran error.

source: I reject it.
es_419: La rechazo.

source: well, they looked very close these days…
es_419: Bueno, … parecen muy cercanos últimamente…

source: what the? is he going home?
es_419: ¿Pero qué…? ¿Se va a casa?

source: 200x.02~200 .02
es_419: 02/200x - 02/200

source: liberal arts A group 1 design
es_419: Humanidades A Grupo 1 - diseño

source: ...because I know what you went through.
es_419: Porque sé todo lo que has pasado.

source: I didn't expect it to be this good since it was just pork, but my goodness...
es_419: No esperaba que fuera tan rico porque era cerdo, pero santo cielo…

source: I told her to go home.
es_419: Le dije que se fuera.

source: enjoy, sir!
es_419: ¡Buen provecho!

source: (too close to take a taxi.)
es_419: (Demasiado cerca para ir en taxi)

source: Could it really be true?
es_419: ¿Será cierto?

source: not now!
es_419: ¡Justo ahora!

source: I tripped on the stairs.
es_419: Me tropecé en la escalera.

source: mr. chae's place
es_419: Casa del Sr. Chae

source: lean
es_419: SE INCLINA

source: I realized that there were things I could still change...
es_419: Me di cuenta de que podía cambiar algunas cosas…

source: he was already a workaholic...
es_419: Ya era un adicto al trabajo…

source: year month day
es_419: AÑO MES DÍA

source: it's like he can't finish a single sentence today.
es_419: Parece que hoy no puede terminar una sola oración.

source: pile
es_419: MONTAÑA

source: me too.
es_419: Yo también.

source: opened her eyes without realizing.
es_419: Abrió los ojos sin darse cuenta.

source: clatter
es_419: CLAC

source: sheesh!
es_419: ¡Dios!

source: hehehe
es_419: JEJEJE

source: I can't find the right time to say sorry!
es_419: ¡No encuentro el momento ideal para disculparme!

source: baking one-day class 1:30
es_419: Clase única de horneado 13:30

source: and what's with this vibe?
es_419: ¿Y esta vibra?

source: I could ask ms. gam if she was here.
es_419: Ojalá pudiera preguntarle a la señorita Gam.

source: jiwoo, I'm so screwed.
es_419: Jiwoo, estoy frita.

source: are you going to another company? or taking a break?
es_419: ¿Te vas a otra empresa? ¿Te tomas un descanso?

source: and did you not already know that?
es_419: ¿Cómo puede ser que no lo supieras?

source: ...and if she and I are hoping for the same thing.
es_419: … y si ella y yo anhelamos lo mismo.

source: sir.
es_419: Señor.

source: ceo of iren, the nation‘s top cosmetics company
es_419: CEO de IREN, la mejor empresa de cosméticos del país.

source: like write comment
es_419: Me gusta Comentario

source: turn
es_419: GIRA

source: what is this icky feeling as if I was just caught cheating?
es_419: Qué sensación desagradable, como si me hubiera atrapado in fraganti.

source: ...but I'm not that nice of a person.
es_419: … pero no soy tan buena persona.

source: fierce
es_419: feroz

source: I guess you were lonely!!!
es_419: ¡¡Te habrás sentido sola!!

source: smirk
es_419: JEJE

source: L
es_419: i

source: [noun] the quality or state of being delayed beyond the expected or proper time.
es_419: [verbo] Acción y efecto de demorarse más de lo esperado o lo acordado.

source: nom
es_419: ñam

source: I'm sure it's here…
es_419: Seguro que es aquí…

source: that's right, come to think of it,
es_419: Cierto. Ahora que lo pienso,

source: I am hoping that Yu-eun has come to reach the same conclusion that I have.
es_419: Deseo que Yu-eun haya llegado a la misma conclusión que yo.

source: it's yu-eun now, is it?
es_419: ¿Así que es Yu-eun?

source: customer
es_419: cliente

source: But why me?
es_419: ¿Por qué yo?

source: And to a point where you can't remember anything?
es_419: ¿Al punto que no te acuerdas de nada?

source: I knew that, but it's still shocking.
es_419: Ya lo sabía, pero igual impacta.

source: I'm bored!
es_419: ¡Me aburro!

source: although I only have one!
es_419: ¡Aunque solo tengo una!

source: yu-eun, let's go have lunch.
es_419: Yu-eun, vamos a almorzar.

source: I forgot my friend was coming!
es_419: ¡Olvidé que venía mi amiga!

source: ahh!
es_419: ¡Aah!

source: ah, I see.
es_419: Ah, entiendo.

source: I normally sleep around 12, sir.
es_419: En general me acuesto a las doce.

source: where are you going?
es_419: ¿A dónde vas?

source: did you hear about our workshop?
es_419: ¿Ya te enteraste de lo del taller?

source: whoa
es_419: GUAU

source: you're yu-eun gam, right?
es_419: Eres Yu-eun, ¿cierto?

source: well...
es_419: Eh…

source: yo, dohyeok!
es_419: ¡Eu, Dohyeok!

source: (fact: dohyeok hates cucumbers)
es_419: (Dato: Dohyeok detesta el pepino)

source: g l a r e
es_419: f u l m i n a

source: I was a nuisance to him.
es_419: Yo era un estorbo para él.

source: droop
es_419: decaído

source: ...there have been some incidences to make me confused lately, but still.
es_419: Últimamente hubo algunos episodios que me confundieron, pero igual.

source: slurp
es_419: SORBE

source: ...after helping him hire my replacement and training him or her.
es_419: … para ayudarlo a contratar mi reemplazo y capacitar a esa persona.

source: you're in deep trouble if you cross the line.
es_419: Si te pasas de la raya, te meterás en problemas.

source: Let's enjoy the peace.
es_419: Mejor disfruto esta paz.

source: ...and I found out what kind of coffee you like.
es_419: … y aprendí cómo te gusta el café.

source: I'm the one who's grateful.
es_419: Soy yo el que te agradece a ti.

source: if I order food at home...
es_419: Si pido comida…

source: ...on a friday night.
es_419: … el viernes por la noche.

source: I was waiting for you.
es_419: Te estaba esperando.

source: is it just a family, a very wealthy family...
es_419: Es solo una familia; ¿una familia muy rica…

source: we’re searching for a new company, sir.
es_419: Estamos buscando una nueva empresa, señor.

source: the food just came…
es_419: Acaba de llegar la comida…

source: pat
es_419: TAP

source: something's wrong...
es_419: Algo anda mal…

source: I'm sorry. let me reconnect.
es_419: Lo siento. Me vuelvo a conectar.

source: sob
es_419: SNIF

source: by the way…
es_419: Por cierto…

source: but what about dinner?
es_419: ¿Y la cena?

source: she's my secretary, not my girlfriend.
es_419: Es mi secretaria, no mi novia.

source: I can't believe I let such a competent employee go.
es_419: Increíble que haya dejado ir a alguien tan competente.

source: you think you're all grown up.
es_419: Te crees tan maduro.

source: ah, looks good.
es_419: Ah, quedó bien.

source: - episode 15 -
es_419: - episodio 15 -

source: he's in a bad mood.
es_419: Está de mal humor.

source: where am I?!
es_419: ¡¿Dónde estoy?!

source: ending 1 deep rooted tree
es_419: Final 1 Árbol enraizado

source: whew...
es_419: Fiu…

source: friday
es_419: viernes

source: -Write down your name and exam number in the corresponding column of the answer sheet. -Questions worth 3 points are noted separately.
es_419: -Escriba su nombre y número de examen en la columna correspondiente de la hoja de respuestas. -Las respuestas de 3 puntos se marcan aparte.

source: here!
es_419: ¡Toma!

source: salt
es_419: sal

source: oh? are you leaving the company?
es_419: Ah, ¿te irás de la empresa?

source: goosebumps
es_419: PIEL DE GALLINA

source: oh, gosh…
es_419: Ay, cielos…

source: and you should meet different people.
es_419: y deberías conocer gente nueva.

source: flash
es_419: luces

source: but I'll just get through it with some small talk.
es_419: pero mejor paso el tiempo con charla trivial.

source: t-that's!
es_419: ¡E-es…!

source: whatever happens!
es_419: ¡Pase lo que pase!

source: um.
es_419: Eh…

source: from now on, let's eat together unless we have some other urgent matters.
es_419: Comeremos juntos a partir de ahora, a menos que tengamos asuntos urgentes.

source: ...but don't be fooled!
es_419: ¡Pero no se dejen engañar!

source: I knew it was more than that! he wants to talk about my resignation.
es_419: ¡Sabía que había algo más! Quiere hablar sobre mi renuncia.

source: I even thought about the old days.
es_419: Me puse a pensar en los viejos tiempos.

source: don't worry.
es_419: Tranquila.

source: he's a member of a chaebol family.
es_419: Pertenece a una familia poderosa.

source: well... he is quite a looker.
es_419: Pero… qué apuesto es.

source: is delivery okay? what would you like?
es_419: ¿Está bien si pedimos? ¿Qué quieres comer?

source: is it something urgent, sir?
es_419: ¿Pasó algo urgente, señor?

source: she barely had a social life because of the heavy workload.
es_419: Ella casi no tenía vida social de tanto trabajar.

source: followed dohyeok to Jeju island thinking that he was going there for fun
es_419: Siguió a Dohyeok a la isla Jeju porque pensó que iba a pasarla bien

source: oh. you're so funny.
es_419: Ay, eres muy divertida.

source: feeling guilty…
es_419: Se siente culpable…

source: emoticon…
es_419: Un emoji…

source: yu-eun, I…
es_419: Yu-eun, yo…

source: a book every CEO must read in times of crisis
es_419: Lo que todo CEO debe leer en momentos de crisis

source: blink
es_419: parpadea

source: seriously?!
es_419: ¡¿En serio?!

source: does he not remember?
es_419: ¿Acaso no se acuerda?

source: all right!
es_419: ¡Muy bien!
